In [3]:
# imports
import pandas as pd
import matplotlib.pyplot

%matplotlib inline

In [6]:
# read files 
private_data_original = pd.read_csv('../data/private_dataB.csv')
public_data_register = pd.read_csv('../data/public_data_registerB.csv')
public_data_results = pd.read_csv('../data/public_data_resultsB.csv')

## Observing the data

In [11]:
print(private_data_original.shape)
private_data_original.head(5)

(200, 10)

,Unnamed: 0,name,sex,evote,dob,zip,education,citizenship,marital_status,party
0,0,"Donner, Brittany",Female,0,1919-01-09,2300,Vocational bachelors educations,Denmark,Widowed,Red
1,1,"Wilkerson, Allison",Female,0,1930-09-22,2200,Vocational Education and Training (VET),Denmark,Widowed,Red
2,2,"al-Sayed, Tameema",Female,1,1985-10-04,2100,Vocational Education and Training (VET),Denmark,Married/separated,Green
3,3,"Rowe, Nathan",Male,0,1967-05-01,2400,Vocational Education and Training (VET),Denmark,Widowed,Green
4,4,"Ambriz-Mendez, Andrew",Male,0,1992-04-01,2200,Masters programmes,Denmark,Never married,Green

In [10]:
print(public_data_register.shape)
public_data_register.head(5)

(1515, 8)

,Unnamed: 0,name,sex,dob,zip,citizenship,marital_status,last_voted
0,0,"Le, Ian",Male,1998-08-30,2300,Denmark,Never married,1
1,1,"Wang, Caleb",Male,1996-04-23,2200,Denmark,Never married,1
2,2,"Carranco, Raquel",Female,1994-08-06,2200,Denmark,Never married,1
3,3,"Williams, Geona",Female,1995-04-22,2100,Sweden,Never married,2
4,4,"Gonzales, Edward",Male,2000-05-13,2100,Denmark,Never married,1

In [12]:
print(public_data_results.shape)
public_data_results.head(5)

(6, 6)

   Unnamed: 0               Unnamed: 0.1  Red  Green  Invalid ballots  Total
0           0  Polling station: ZIP 2100   23     88                1    112
1           1  Polling station: ZIP 2200   63    122                5    190
2           2  Polling station: ZIP 2300  106     88                5    199
3           3  Polling station: ZIP 2400   81    153                7    241
4           4                    E-votes   89    225                5    319